ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
/***
 * 題名：操作制御アプリ
 * 作成者：浅尾　享一
 * 操作制御を行うアプリケーション
***/
#include "tmpm380_OPRCNT.h"

const uint8_t PATMAX[3] = {
    /* 品温、？、徐冷時間MAX */
    50, 0, 30
};
const uint8_t PATMIN[3] = {
    /* 品温、？、徐冷時間MIN */
    10, 0, 2
};

const uint8_t STMTBL[16] = {
    /* 品温設定の下限値テーブル */
    9, 9, 12, 12,/* 35R */
    7, 7, 12, 7,/* 50R */
    7, 7, 12, 7,/* 100R */
    9, 9, 12, 12
};

void OPRCNT(void)
{
    OS_TSKCon1 *OS_LoadTime;/* OS設定値を読むためのポインタ構造体に名前をつける */
    OS_LoadTime = OSTSKCon1S();/* 関数経由でポインタをOSparamにアクセス */
    
    uint8_t REG_00 = 0;/* 一時変数 */
    
    if (TNO > 0) {
        /* セルフテスト中である場合 */
        OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
        OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
        
        return;
        
    }
    
    if ((STSFL1 & 0x01) > 0) {
        /* セルフテスト受付中である場合 */
        if ((MXSW & 0x90) < 0x90) {
            /* チラー予約と電源SWが押されていない場合 */
            STSAST = 0;
            STSFL1 &= 0xFE;/* セルフテスト受付中をクリア */
            
        } else {
            /* チラー予約と電源SWが押されている場合 */
            STSAST++;/* タイマインクリメント */
            if (STSAST >= 60) {
                /* 3秒経過した場合 */
                STSAST = 0;/* タイマ―クリア */
                TNO = 1;/* セルフテスト1へ */
                
            }
            
            OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
            
            return;
            
        }
        
    }
    
    if ((STSFL1 & 0x02) > 0) {
        /* メモリークリア受付中である場合 */
        if ((MXSW & 0x50) < 0x50) {
            /* 運転と電源スイッチが押されていない場合 */
            MCLAST = 0;/* タイマクリア */
            STSFL1 &= 0xFD;/* 受付中をクリア */
            
        } else {
            /* 運転と電源スイッチが押されている場合 */
            MCLAST++;/* インクリメント */
            if (MCLAST < 60) {
                /* 3秒未満である場合 */
                /* 何もしない */
                OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
                
                return;
                
            } else if (MCLAST == 60) {
                /* 3秒ジャストである場合 */
                BLCLR();/* メモリクリア */
                if ((SYKND0 & 0x20) > 0) {
                    /* 15℃仕様である場合 */
                    *HENNP[4] = 15;/* 設定温度を15℃仕様に変更する */
                    *HENNP[5] = 15;
                    *HENNP[6] = 15;
                    *HENNP[7] = 15;
                    
                }
                
                MCLAST = 60;/* 上限セット */
                
                OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
                
                return;
                
            } else {
                /* 3秒超の場合 */
                MCLAST = 60;/* 上限セット */
                
                OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
                
                return;
                
            }
            
        }
        
    } else {
        /* メモリークリア受付中ではない場合 */
        if (((SYSFLG & 0x40) == 0) && ((STSFL1 & 0x08) > 0) && ((MXSWO0 & 0x20) > 0)) {
            /* 電源オフで、手動排水受付中で、選択スイッチがオンである場合 */
            MDAST++;/* タイマインクリメント */
            
            if (MDAST >= 60) {
                /* 3秒経過した場合 */
                STSFL0 |= 0x40;/* セットクリック音 */
                STSFL1 |= 0x10;/* 手動排水受付フラグをセット */
                
                WLCTM5 = 0;/* 排水表示時間をクリアする */
                RPAT |= 0xC0;/* 排水状態フラグセット */
                
            }
            
        } else {
            /* 電源オン又は手動排水受付中ではない又は選択スイッチがオフである場合 */
            STSFL1 &= 0xF7;/* 手動排水受付中をクリア */
            MDAST = 0;/* タイマクリア */
            
        }
        
        if ((STSFL0 & 0x02) == 0) {
            /* イニシャライズが未完了である場合 */
            if (MXSW == 0x90) {
                /* チラー予約と電源スイッチが押されている場合 */
                KFLG = 0x90;/* キーフラグ作成 */
                STSFL1 |= 0x01;/* セルフテスト受付中セット */
                
            } else if (MXSW == 0x50) {
                /* 運転と電源スイッチが押されている場合 */
                KFLG = 0x50;/* キーフラグ作成 */
                STSFL1 |= 0x02;/* メモリークリア受付中セット */
                
            }
            
            if ((STSFL1 & 0x03) > 0) {
                /* 受付中が何かセットされている場合 */
                OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
                
                return;
                
            }
            
        }
        
    }
    
    if (((ABNF & 0xC0) == 0) || ((MXOTN2 & 0x80) == 0)) {
        /* 異常警報出力していないときか、外部警報を出していない場合 */
        if (((STSFL0 & 0x08) == 0) && ((STSFL1 & 0x04) == 0)) {
            /* 完了アラーム出力中では無く、マニュアル操作エラーでもない場合 */
            TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリア */
            
        }
        
    }
    
    REG_00 = KFLG;/* キーフラグの値を読み込む */
    KFLG = MXSWO0;/* 現在値に更新 */
    REG_00 ^= KFLG;/* 変化を検知 */
    REG_00 &= MXSWO0;/* ONトリガーのみ残す */
    
    if (REG_00 > 0) {
        /* 何かしらONトリガーを検知した場合 */
        ONTRG = REG_00;/* 保存 */
        
        if (((ABNF & 0x0F) == 0) && ((ONTRG & 0x20) > 0) && ((SYSFLG & 0x1E) == 0)) {
            /* 異常が無く、選択スイッチのオントリガーであり、運転工程中ではない場合 */
            if (((STSFL0 & 0x80) > 0) || ((SYSFLG & 0x40) > 0)) {
                /* 設定モード中又は、電源がオンである場合 */
                if ((RPAT & 0x20) == 0) {
                    /* 洗浄工程中ではない場合 */
                    STSFL0 |= 0x40;/* クリック音をセット */
                    NPAT++;/* パターン選択を更新 */
                    NPAT &= 0x03;/* 必要な分だけマスクする */
                    
                }
                
            } else {
                /* 設定モードではなく電源オフである場合 */
                if ((MXOTN0 & 0xC0) > 0) {
                    /* 排水弁が閉じている場合 */
                    STSFL0 |= 0x40;/* クリック音セット */
                    STSFL1 |= 0x08;/* 手動排水操作受付中フラグをセット */
                    MDAST = 0;/* 手動排水受付中タイマをクリア */
                    
