ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
                }
                
            }
            
        }
        
        if (((ABNF & 0x0F) > 0) || ((RPAT & 0x20) == 0)) {
            /* 異常ありか、洗浄工程中でない場合 */
            if ((ONTRG & 0x10) > 0) {
                /* 電源スイッチのオントリガである場合 */
                RPAT &= 0xDF;/* 洗浄工程をリセットする */
                
                SYSFLG ^= 0x40;/* RENEW */
                SYSFLG &= 0xE1;/* 必要な分だけマスク */
                STSFL0 &= 0xDF;/* 準備中をセット */
                STSFL0 |= 0x40;/* クリック音セット */
                
                ABNF &= 0x20;/* 異常及びチラー異常をリセットする */
                
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をオフにする */
                MXOTN2 &= 0x7F;/* 外部警報出力をオフ */
                REG_00 = TSB_PC->DATA;/* データレジスタをロード */
                REG_00 &= 0x07;/* マスクセット */
                REG_00 |= (MXOTN2 & 0xF8);/* データセット */
                TSB_PC->DATA = REG_00;/* 更新 */
                
                if ((SYSFLG & 0x40) > 0) {
                    /* 電源オンである場合 */
                    SYSFLG &= 0xDF;/* チラー予約解除 */
                    
                }
                
                if ((STSFL0 & 0x80) == 0) {
                    /* 設定中ではない場合 */
                    DSPSEQ = 0;/* シーケンスクリア */
                    
                }
                
            }
            
        }
        
        if (((SYSFLG & 0x40) > 0) && ((STSFL0 & 0x80) == 0) && ((ONTRG & 0x40) > 0)) {
            /* 電源がオンで、設定モード中ではなく、運転スイッチのオントリガ―を検知した場合 */
            if ((ABNF & 0xC0) > 0) {
                /* 異常警報出力中である場合 */
                ABNF &= 0x3F;/* 異常警報出力をリセット */
                
            } else if ((STSFL1 & 0x80) > 0) {
                /* 真空解除中のアラーム要求がある場合 */
                STSFL1 &= 0x7F;/* 真空解除中のアラーム要求フラグをオフにする */
                STSFL0 &= 0xF7;/* 完了アラーム出力中フラグをオフにする */
                
                TSB_PC_DATA_PC2 = 0;/* ブザーをオフにする */
                MXOTN2 &= 0x7F;/* 外部警報出力をオフする */
                REG_00 = TSB_PC->DATA;/* データレジスタをロード */
                REG_00 &= 0x07;/* 必要なだけマスク */
                REG_00 |= (MXOTN2 & 0xF8);/* ORする */
                TSB_PC->DATA = REG_00;/* 更新 */
                
            } else if (CCSEQ == 15) {
                /* 冷却完了であった場合 */
                CCSEQ = 0;/* 冷却シーケンスをクリアする */
                STSFL0 &= 0xF7;/* 完了アラーム出力中フラグをオフにする */
                                
                TSB_PC_DATA_PC2 = 0;/* ブザーをオフにする */
                MXOTN2 &= 0x7F;/* 外部警報出力をオフする */
                REG_00 = TSB_PC->DATA;/* データレジスタをロード */
                REG_00 &= 0x07;/* 必要なだけマスク */
                REG_00 |= (MXOTN2 & 0xF8);/* ORする */
                TSB_PC->DATA = REG_00;/* 更新 */
                
                STSFL0 |= 0x40;/* クリックフラグセット */
                SYSFLG &= 0xE1;/* 運転フラグを全てオフにする */
                STSFL0 &= 0xDF;/* 準備中フラグをクリアする */
                
                if ((STSFL0 & 0x80) == 0) {
                    /* 設定モード中で無い場合 */
                    DSPSEQ = 0;
                    
                }
                
            } else if ((STSFL0 & 0x20) == 0) {
                /* 準備中である場合 */
                /* 何もしない */
                
            } else if (((ABNF & 0x0F) == 0) || ((ABNF & 0x0F) == 8) || ((ABNF & 0x0F) == 9) || ((ABNF & 0x0F) == 14)) {
                /* 異常なし、又は常温槽水位電極棒異常か、又は常温温度センサー異常、真空度異常である場合 */
                if ((SYSFLG & 0x02) == 0) {
                    /* 運転がオフの場合 */
                    if ((ABNF & 0x0F) > 0) {
                        /* 待機中の異常がある場合 */
                        /* 何もしない */
                        
                    } else {
                        /* 異常が無い場合 */
                        SYSFLG |= 0x02;/* 運転フラグをオンする */
                        STIME1 = RTCDT[1];/* 開始時刻「分」のバイナリデータ */
                        STIME2 = RTCDT[2];/* 開始時刻「時」のバイナリデータ */
                        ETIME1 = ETIME2 = 0;/* 終了時刻をクリアする */
                        STSFL0 |= 0x40;/* セットクリック音 */
                        
                    }
                    
                } else {
                    /* 運転がオンである場合 */
                    if (CCSEQ >= 10) {
                        /* 真空解除工程である場合 */
                        /* 何もしない */
                        
                    } else {
                        /* 真空解除工程になっていない場合 */
                        if (((SYKND0 & 0x10) == 0) && (CCSEQ < 4) && ((short)SWTMP0 < TMPDT2)) {
                            /* チラー式であり、常温冷却工程が未完了で、設定温度より常温水槽温度が高い場合 */
                            SYSFLG |= 0x01;/* 常温槽排水をセットする */
                            
                        }
                        
                        SYSFLG &= 0xE3;/* 各工程フラグをリセットする */
                        CCSEQ = 10;/* 真空解除工程をセットする */
                        DSPSEQ = 0;/* ディスプレーシーケンスをクリア */
                        ETIME1 = RTCDT[1];/* 終了時刻「分」セット */
                        ETIME2 = RTCDT[2];/* 終了時刻「時」セット */
                        
                        STSFL0 |= 0x40;/* クリック音セット */
                        STSFL1 |= 0x40;/* 真空解除工程中のアラーム禁止をセット */
                        ABNF &= 0xBF;/* 継続異常時の異常警報をリセット */
                        
                    }
                    
                }
                
            }
            
        }/* 電源がオフか、設定モード中であるか、運転スイッチのオントリガ―未検知の場合はここに抜ける */
        
        if (((RPAT & 0x20) == 0) && ((ONTRG & 0x80) > 0) && ((SYKND0 & 0x10) == 0) && ((ABNF & 0x0F) == 0)) {
            /* 洗浄工程中ではなく、チラー予約スイッチが押されており、チラー式であり、異常がない場合 */
            SYSFLG ^= 0x20;/* チラー予約ビットを反転する */
            STSFL0 |= 0x40;/* クリック音セット */
            
        }
        
        if (((STSFL0 & 0x80) > 0) && (DSPSEQ > 0)) {
            /* 設定モードであり、ディスプレーシーケンスが1以上である場合 */
            OPRSET();/* 設定モードの操作処理へ */
            
        }
        
        if (((ONTRG & 0x08) > 0) && ((ABNF & 0x0F) == 0)) {
            /* 設定スイッチのオントリガーで、異常なしである場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            STSFL0 ^= 0x80;/* 設定モード中フラグを反転 */
            DSPSEQ = 0;/* 表示シーケンスをクリア */
            DSPSSQ = 0;/* 表示サブシーケンスをクリア */
            STSFL0 |= 0x10;/* 表示切り替え時、最初はブザー音禁止フラグをセット */
            
