ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
        }
        
    }/* ONトリガーを検知できていない場合はここに抜ける */
    
    if ((STSFL0 & 0x80) == 0) {
        /* 設定モードではでない場合 */
        INDPTM = 0;/* 通常表示復帰タイマをクリア */
        
    } else {
        /* 設定モード中である場合 */
        if (DSPSEQ != 4) {
            /* 洗浄モードでは無い場合 */
            if ((MXSWO0 & 0x2F) > 0) {
                /* 設定モードに関係するスイッチ入力があった場合 */
                INDPTM = 0;/* 通常表示復帰タイマをクリア */
                
            } else {
                /* 設定モードに関係するスイッチ入力が無い場合 */
                if (INDPTM >= 12000) {
                    /* 10分経過した場合 */
                    INDPTM = 0;/* 通常表示復帰タイマをクリア */
                    STSFL0 &= 0x7F;/* 設定モードをクリア */
                    DSPSEQ = 0;/* ディスプレーシーケンスをクリア */
                    DSPSSQ = 0;/* ディスプレーサブシーケンスをクリア */
                    STSFL0 |= 0x40;/* 設定モードの解除クリック音セット */
                    MMODE = 0;/* マニュアルモードナンバーをクリア */
                    
                }
                
            }
            
        } else if (DSPSSQ == 3) {
            /* 洗浄中断操作表示である場合 */
            CLNRTM++;/* タイマインクリメント */
            if (CLNRTM >= 200) {
                /* 10秒経過した場合 */
                CLNRTM = 0;/* タイマクリア */
                DSPSSQ = 2;/* 洗浄工程表示をセット */
                
            }
            
        }
        
    }
    
    if (((STSFL0 & 0x40) > 0) && ((ABNF & 0x80) == 0) && ((STSFL0 & 0x08) == 0) && ((STSFL1 & 0x04) == 0)) {
        /* クリックがセットされており、異常警報出力が無く、完了アラーム出力中では無く、マニュアルモードの操作エラーで無い場合 */
        TSB_PC_DATA_PC2 = 1;/* ブザー出力をオンする */
        
    }
        
    OS_LoadTime->NEXT_LOAD_Time[6] = 50;/* 次回呼び出し時間 */
    OS_LoadTime->TSK_COND[6] = 0xA0;/* 遅延フラグ建築 */
    
    return;
}

/***
 * 題名：設定モード時の操作制御
 * 作成者：浅尾　享一
 * 設定中の操作制御を行うサブルーチン
***/
void OPRSET(void)
{
    uint8_t REG_00 = 0;
    
    /* トップメニューコントロール */
    if (DSPSSQ == 0) {
        /* サブシーケンスが０（トップメニュー）時 */
        if (((ONTRG & 0x04) > 0) && ((DSPSEQ != 4) || ((DSPSEQ == 4) && ((SYSFLG & 0x40) == 0)))) {
            /* →スイッチのオントリガで、洗浄モードの選択では無いか、洗浄モードの選択で電源がオフであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            DSPSSQ = 1;/* サブシーケンス1にする */
            
            if (DSPSEQ == 1) {
                /* 画面シーケンスが「１」パターン設定である場合 */
                /* 設定用データにセット */
                if (NPAT == 0) {
                    /* 1選択時 */
                    EDDT[0] = PAT1;/* 1をセット */
                    
                } else if (NPAT == 1) {
                    /* 2選択時 */
                    EDDT[0] = PAT2;/* 2をセット */
                    
                } else if (NPAT == 2) {
                    /* 3選択時 */
                    EDDT[0] = PAT3;/* 3をセット */
                    
                } else {
                    /* 4選択時 */
                    EDDT[0] = PAT4;/* 4をセット */
                    
                }
                
            } else if (DSPSEQ == 2) {
                /* 画面シーケンスが「２」常温水槽温度設定である場合 */
                EDDT[0] = SWTMP0;/* 設定用データにセット */
                
            } else if (DSPSEQ == 3) {
                /* 画面シーケンスが「３」自動排水モード設定である場合 */
                EDDT[0] = (SYSFLG & 0x80);/* 設定用データにセット */
                
            } else if (DSPSEQ == 4) {
                /* 画面シーケンスが「４」洗浄モード設定である場合 */
                EDDT[0] = 0;/* 設定用データにセット */
                
            } else if (DSPSEQ == 5) {
                /* 画面シーケンスが「５」チラー予約時刻設定である場合 */
                EDDT[0] = SETTM;/* 設定用データにセット */
                EDDT[1] = SETTH;/* 設定用データにセット */
                
            } else if (DSPSEQ == 6) {
                /* 画面シーケンスが「６」現在時刻設定である場合 */
                EDDT[0] = RTCDT[1];/* 設定用データにセット */
                EDDT[1] = RTCDT[2];/* 設定用データにセット */
                EDDT[2] = RTCDT[4];/* 設定用データにセット */
                EDDT[3] = RTCDT[5];/* 設定用データにセット */
                EDDT[4] = RTCDT[6];/* 設定用データにセット */
                
            } else {
                /* それ以外の場合 */
                DABHP = 0;/* 異常履歴場所クリア */
                
            }
            
        } else if ((ONTRG & 0x02) > 0) {
            /* DOWNスイッチである場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            DSPSEQ++;/* シーケンスをインクリメント */
            
            if ((DSPSEQ == 5) && ((SYKND0 & 0x10) > 0)) {
                /* チラー予約画面で蒸気式であった場合 */
                DSPSEQ = 6;/* チラー予約をスキップする */
                
            }
            
            if (DSPSEQ >= 8) {
                /* 上限以上になった場合 */
                DSPSEQ = 1;/* 下限値にFIX */
                
            }
            
        } else if ((ONTRG & 0x01) > 0) {
            /* UPスイッチである場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            DSPSEQ --;/* シーケンスをインクリメント */
            
            if ((DSPSEQ == 5) && ((SYKND0 & 0x10) > 0)) {
                /* チラー予約画面で蒸気式であった場合 */
                DSPSEQ = 4;/* チラー予約をスキップする */
                
            }
            
            if (DSPSEQ == 0) {
                /* 下限未満になった場合 */
                DSPSEQ = 7;/* 上限値にFIX */
                
            }
            
        }
        
    } else if ((DSPSEQ & 0x07) == 1) {
        /* パターン登録設定である場合 */
        if (DSPSSQ == 2) {
            /* 徐冷あり/無しの設定である場合 */
            if ((ONTRG & 0x03) > 0) {
                /* UP/DOWNスイッチが押されていた場合 */
                STSFL0 |= 0x40;/* クリック音セット */
                
                if (NPAT == 0) {
                    /* パターン1の場合 */
                    EDDT[0] = (0x01 ^ EDDT[0]);
                    
                } else if (NPAT == 1) {
                    /* パターン2の場合 */
                    EDDT[0] = (0x02 ^ EDDT[0]);
                    
                } else if (NPAT == 2) {
                    /* パターン3の場合 */
                    EDDT[0] = (0x04 ^ EDDT[0]);
                    
                } else {
                    /* パターン4の場合 */
                    EDDT[0] = (0x08 ^ EDDT[0]);
                    
                }
                
                return;/* ここで戻る */
                
