ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
            }
            
        } else if ((ONTRG & 0x01) > 0) {
            /* UPスイッチのオントリガであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            
            EDDT[0]++;/* 値をインクリメント */
            if (EDDT[0] > PATMAX[(DSPSSQ - 1) & 0x03]) {
                /* 上限値を超える場合 */
                EDDT[0] = PATMIN[(DSPSSQ - 1) & 0x03];/* 下限値をセットする */
                
                if (DSPSSQ == 1) {
                    /* 冷却品温設定である場合 */
                    REG_00 = SYKND0;/* ディップスイッチ情報をセット */
                    REG_00 >>= 4;/* 4ビットおろす */
                    EDDT[0] = STMTBL[REG_00];/* 品温設定の下限値をセットする */
                    
                }
                
            }
            
            return;/* ここで戻る */
            
        } else if ((ONTRG & 0x02) > 0) {
            /* ダウンスイッチのオントリガであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            
            EDDT[0] --;/* 値をデクリメント */
            if (DSPSSQ == 1) {
                /* 冷却品温設定である場合 */
                REG_00 = SYKND0;/* ディップスイッチ情報をセット */
                REG_00 >>= 4;/* 4ビットおろす */
                REG_00 = STMTBL[REG_00];/* 冷却品温の下限値 */
                
            } else {
                /* 冷却品温設定以外である場合 */
                REG_00 = PATMIN[(DSPSSQ - 1) & 0x03];/* ノーマル下限値 */
                
            }
            
            if (EDDT[0] < REG_00) {
                /* 下限値を下回る場合 */
                EDDT[0] = PATMAX[(DSPSSQ - 1) & 0x03];/* 上限値をセットする */
                
            }
            
            return;/* ここで戻る */
            
        }
        
        if ((ONTRG & 0x20) > 0) {
            /* 選択スイッチが押されている場合 */
            if ((SYSFLG & 0x1E) > 0) {
                /* 運転中である場合 */
                return;/* 戻る */
                
            }
            
            STSFL0 |= 0x40;/* クリック音セット */
            DSPSSQ = 1;/* 設定トップに変更 */
            
        } else if ((ONTRG & 0x0C) == 0) {
            /* →スイッチと設定スイッチが押されていない場合 */
            return;/* 戻る */
            
        } else if (((ONTRG & 0x04) > 0) || ((ONTRG & 0x0C) == 0x08)) {
            /* →スイッチが押されている、又は設定スイッチが押されている場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            if (DSPSSQ == 1) {
                /* サブシーケンスが「１」、品温設定である場合 */
                if (NPAT == 0) {
                    /* パターン1の場合 */
                    PAT1 = EDDT[0];/* 編集中の値をセットする */
                    
                } else if (NPAT == 1) {
                    /* パターン2の場合 */
                    PAT2 = EDDT[0];/* 編集中の値をセットする */
                    
                } else if (NPAT == 2) {
                    /* パターン3の場合 */
                    PAT3 = EDDT[0];/* 編集中の値をセットする */
                    
                } else {
                    /* パターン4の場合 */
                    PAT4 = EDDT[0];/* 編集中の値をセットする */
                    
                }
                
            } else if (DSPSSQ == 2) {
                /* サブシーケンスが「２」、徐冷有り無しの設定である場合 */
                RPAT &= 0xF0;/* マスク */
                RPAT |= (EDDT[0] & 0x0F);/* 編集中の値をセットする */
                
            } else {
                /* 徐冷時間設定である場合 */
                if (NPAT == 0) {
                    /* パターン1の場合 */
                    SCTM1 = EDDT[0];/* 編集中の値をセットする */
                    
                } else if (NPAT == 1) {
                    /* パターン2の場合 */
                    SCTM2 = EDDT[0];/* 編集中の値をセットする */
                    
                } else if (NPAT == 2) {
                    /* パターン3の場合 */
                    SCTM3 = EDDT[0];/* 編集中の値をセットする */
                    
                } else {
                    /* パターン4の場合 */
                    SCTM4 = EDDT[0];/* 編集中の値をセットする */
                    
                }
                
            }
            
            if ((ONTRG & 0x08) > 0) {
                /* 設定スイッチがONであった場合 */
                return;/* ここで戻る */
                
            }
            
            if (DSPSSQ == 2) {
                /* 徐冷有り無しの設定である場合 */
                REG_00 = (0x01 << NPAT);/* ビットをセット */
                if ((RPAT & REG_00) == 0) {
                    /* 徐冷なしである場合 */
                    DSPSSQ = 1;/* 項目の最初セット */
                    
                } else {
                    /* 徐冷有りの場合 */
                    DSPSSQ++;/* インクリメント */
                    if (DSPSSQ >= 4) {
                        /* 最大値以上になった場合 */
                        DSPSSQ = 1;/* 項目の最初セット */
                        
                    }
                    
                }
                
            } else {
                /* 徐冷有り無し以外の設定である場合 */
                DSPSSQ++;/* インクリメント */
                if (DSPSSQ >= 4) {
                    /* 最大値以上になった場合 */
                    DSPSSQ = 1;/* 項目の最初セット */
                    
                }
                
            }
            
        }
        
        /* 次の設定値をセットする処理 */
        if (DSPSSQ == 1) {
            /* 次回、冷却温度設定である場合 */
            if (NPAT == 0) {
                /* パターン1である場合 */
                EDDT[0] = PAT1;
                
            } else if (NPAT == 1) {
                /* パターン2である場合 */
                EDDT[0] = PAT2;
                
            } else if (NPAT == 2) {
                /* パターン3である場合 */
                EDDT[0] = PAT3;
                
            } else {
                /* パターン4である場合 */
                EDDT[0] = PAT4;
                
            }
            
        } else if (DSPSSQ == 2) {
            /* 徐冷あり/なしの設定である場合 */
            EDDT[0] = (RPAT & 0x0F);/* LSBの4ビットをセットする */
            
        } else {
            /* 徐冷時間の設定である場合 */
            if (NPAT == 0) {
                /* パターン1である場合 */
                EDDT[0] = SCTM1;
                
            } else if (NPAT == 1) {
                /* パターン2である場合 */
                EDDT[0] = SCTM2;
                
            } else if (NPAT == 2) {
                /* パターン3である場合 */
                EDDT[0] = SCTM3;
                
            } else {
                /* パターン4である場合 */
                EDDT[0] = SCTM4;
                
