ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
            }
            
        }
        
        /* パターン登録設定である場合ここまで */
        
    } else if ((DSPSEQ & 0x07) == 2) {
        /* 常温水槽温度設定である場合 */
        if ((ONTRG & 0x01) > 0) {
            /* UPスイッチであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            EDDT[0]++;/* インクリメント */
            
            if ( (((SYKND0 & 0x10) == 0) && (EDDT[0] > 35))
            || (((SYKND0 & 0x10) > 0) && (EDDT[0] > 40)) ) {
                /* 上限を超えた場合 */
                EDDT[0] = 20;/* 下限値FIX */
                
            }
            
        } else if ((ONTRG & 0x02) > 0) {
            /* DOWNスイッチであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            EDDT[0] --;/* デクリメント */
            
            if (EDDT[0] < 20) {
                /* 下限値未満になった場合 */
                if ((SYKND0 & 0x10) == 0) {
                    /* チラー式である場合 */
                    EDDT[0] = 35;/* MAX FIX */
                    
                } else {
                    /* 蒸気式である場合 */
                    EDDT[0] = 40;/* MAX FIX */
                    
                }
                
            }
            
        } else if ((ONTRG & 0x08) > 0) {
            /* 設定スイッチであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            SWTMP0 = EDDT[0];/* 設定値反映 */
            
        }
        
        /* 常温水槽温度設定である場合ここまで */
        
    } else if ((DSPSEQ & 0x07) == 3) {
        /* 自動排水モード設定である場合 */
        if ((ONTRG & 0x03) > 0) {
            /* UP/DOWNが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            EDDT[0] ^= 0x80;/* 自動排水設定を更新 */
            
        } else if ((ONTRG & 0x08) > 0) {
            /* 設定スイッチであった場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            SYSFLG &= 0x7F;/* 最上位ビットをクリア */
            SYSFLG |= (EDDT[0] & 0x80);/* 自動排水設定更新 */
            
        }
        
        /* 自動排水モード設定である場合ここまで */
        
    } else if ((DSPSEQ & 0x07) == 4) {
        /* 洗浄モード設定である場合 */
        INDPTM = 0;/* 通常表示復帰タイマをクリアする */
        
        if (DSPSSQ == 1) {
            /* 洗浄中ではない場合 */
            if ((ONTRG & 0x08) > 0) {
                /* 設定スイッチのオントリガであった場合 */
                ONTRG &= 0xF7;/* 設定スイッチオントリガをクリア */
                STSFL0 |= 0x40;/* クリック音をセット */
                
                if (EDDT[0] == 0) {
                    /* 洗浄起動ではない場合 */
                    STSFL0 &= 0x7F;/* 設定モードを解除する */
                    DSPSEQ = DSPSSQ = 0;/* シーケンスをクリア */
                    
                } else if ((SYSFLG & 0x40) > 0) {
                    /* 電源がオンである場合 */
                    STSFL0 &= 0x7F;/* 設定モードを解除する */
                    DSPSEQ = DSPSSQ = 0;/* シーケンスをクリア */
                    
                } else {
                    /* 電源がオフであった場合 */
                    SYSFLG |= 0x40;/* 電源フラグをオンする */
                    DSPSSQ = 2;/* 洗浄工程表示をセット */
                    RPAT |= 0x20;/* 洗浄モードフラグをセットする */
                    CCSEQ = 20;/* 洗浄シーケンスの先頭をセット */
                    WCTM1 = WCTM2 = 0;/* 洗浄時の各弁動作タイマをクリア */
                    
                }
                
            } else if ((ONTRG & 0x03) > 0) {
                /* UP/DOWNのオントリガを検知した場合 */
                STSFL0 |= 0x40;/* クリック音をセット */
                EDDT[0] ^= 0x01;/* 選択を更新 */
                
            }
                
        } else if (DSPSSQ == 2) {
            /* 洗浄工程表示である場合 */
            if (ONTRG > 0) {
                /* 何かしらのスイッチのオントリガを検知した場合 */
                STSFL0 |= 0x40;/* クリック音をセット */
                ONTRG &= 0xF7;/* 設定スイッチを強制オフにする */
                DSPSSQ = 3;/* 洗浄工程強制中止選択表示に */
                EDDT[0] = 0;/* 編集エリアに洗浄継続をセット */
                
            }
            
        } else {
            /* それ以外の画面（洗浄工程強制中止選択表示）の場合 */
            if ((ONTRG & 0x0B) > 0) {
                /* 設定・UP・DOWNスイッチのどれかが押されている場合 */
                CLNRTM = 0;/* 洗浄工程表示復帰タイマをクリアする */
                
                if ((ONTRG & 0x08) == 0) {
                    /* このスイッチの内、設定スイッチがオフの場合 */
                    EDDT[0] ^= 0x01;/* 反転 */
                    STSFL0 |= 0x40;/* くりっく音セット */
                    
                } else {
                    /* 設定スイッチがオンであった場合 */
                    ONTRG &= 0xF7;/* 設定スイッチをクリア */
                    STSFL0 |= 0x40;/* くりっく音セット */
                    
                    if (EDDT[0] == 0) {
                        /* 洗浄継続である場合 */
                        DSPSSQ = 2;/* 洗浄工程表示をセット */
                        CLNRTM = 0;/* 洗浄工程表示復帰タイマをクリア */
                        
                    } else {
                        /* 洗浄継続ではない場合 */
                        STSFL0 &= 0x7F;/* 設定モードを解除 */
                        SYSFLG &= 0xBF;/* 電源フラグをオフ */
                        
                        DSPSEQ = DSPSSQ = 0;/* ディスプレーシーケンスをクリア */
                        
                        RPAT |= 0xC0;/* 排水フラグをセット */
                        RPAT &= 0xDF;/* 洗浄モードを解除 */
                        
                        WCTM1 = WCTM2 = 0;/* 洗浄時の各弁動作タイマをクリア */
                        TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                        MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                        STSFL0 &= 0xF7;/* 完了アラーム出力中をクリア */
                        
                        REG_00 = TSB_PC->DATA;
                        REG_00 &= 0x07;
                        REG_00 |= (MXOTN2 & 0xF8);
                        TSB_PC->DATA = MXOTN2;/* 出力更新 */
                        
                    }
                    
                }
                
            }/* 設定・UP・DOWNスイッチのどれかが押されていない場合はここに抜ける */
            
        }
        
        /* 洗浄モード設定である場合ここまで */
        
    } else if ((DSPSEQ & 0x07) == 5) {
        /* チラー予約時刻設定である場合 */
        if ((ONTRG & 0x01) > 0) {
            /* UPスイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            if (DSPSSQ == 1) {
                /* 「時」の設定である場合 */
                EDDT[1]++;/* インクリメント */
                if (EDDT[1] > 23) {
                    /* 上限を超えた場合 */
                    EDDT[1] = 0;
                    
