ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
                }
                
            } else {
                /* 「分」の設定である場合 */
                EDDT[0]++;/* インクリメント */
                if (EDDT[0] > 59) {
                    /* 上限を超えた場合 */
                    EDDT[0] = 0;
                    
                }
                
            }
            
        } else if ((ONTRG & 0x02) > 0) {
            /* DOWNスイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            if (DSPSSQ == 1) {
                /* 「時」の設定である場合 */
                if (EDDT[1] > 0) {
                    /* 下限超の場合 */
                    EDDT[1]--;/* デクリメント */
                    
                } else {
                    /* ゼロだった場合 */
                    EDDT[1] = 23;/* MAX FIX */
                    
                }
                
            } else {
                /* 「分」の設定である場合 */
                if (EDDT[0] > 0) {
                    /* 下限超の場合 */
                    EDDT[0]--;/* デクリメント */
                    
                } else {
                    /* ゼロだった場合 */
                    EDDT[0] = 59;/* MAX FIX */
                    
                }
                
            }
            
        } else if ((ONTRG & 0x04) > 0) {
            /* →スイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            DSPSSQ++;/* サブシーケンスをインクリメント */
            if (DSPSSQ >= 3) {
                /* 上限以上になった場合 */
                DSPSSQ = 1;/* 下限にする */
                
            }
            
        } else if ((ONTRG & 0x08) > 0) {
            /* 設定スイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            SETTM = EDDT[0];/* 分保存 */
            SETTH = EDDT[1];/* 時保存 */
            
        }
        
        /* チラー予約時刻設定である場合ここまで */
        
    } else if ((DSPSEQ & 0x07) == 6) {
        /* 現在時刻設定である場合 */
        if ((ONTRG & 0x01) > 0) {
            /* UPスイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            if (DSPSSQ == 1) {
                /* 「年」の設定である場合 */
                EDDT[4]++;/* インクリメント */
                if (EDDT[4] > 99) {
                    /* 上限を超えた場合 */
                    EDDT[4] = 0;
                    
                }
                
                if (EDDT[2] > DAYMAX(EDDT[4], EDDT[3])) {
                    /* 日の上限超えちゃう場合 */
                    EDDT[2] = DAYMAX(EDDT[4], EDDT[3]);/* MAX FIX */
                    
                }
                
            } else if (DSPSSQ == 2) {
                /* 「月」の設定である場合 */
                EDDT[3]++;/* インクリメント */
                if (EDDT[3] > 12) {
                    /* 上限を超えた場合 */
                    EDDT[3] = 1;
                    
                }
                
                if (EDDT[2] > DAYMAX(EDDT[4], EDDT[3])) {
                    /* 日の上限超えちゃう場合 */
                    EDDT[2] = DAYMAX(EDDT[4], EDDT[3]);/* MAX FIX */
                    
                }
                
            } else if (DSPSSQ == 3) {
                /* 「日」の設定である場合 */
                EDDT[2]++;/* インクリメント */
                if (EDDT[2] > DAYMAX(EDDT[4], EDDT[3])) {
                    /* 上限を超えた場合 */
                    EDDT[2] = 1;
                    
                }
                
            } else if (DSPSSQ == 4) {
                /* 「時」の設定である場合 */
                EDDT[1]++;/* インクリメント */
                if (EDDT[1] > 23) {
                    /* 上限を超えた場合 */
                    EDDT[1] = 0;
                    
                }
                
            } else if (DSPSSQ == 5) {
                /* 「分」の設定である場合 */
                EDDT[0]++;/* インクリメント */
                if (EDDT[0] > 59) {
                    /* 上限を超えた場合 */
                    EDDT[0] = 0;
                    
                }
                
            }
            
        } else if ((ONTRG & 0x02) > 0) {
            /* DOWNスイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            if (DSPSSQ == 1) {
                /* 「年」の設定である場合 */
                if (EDDT[4] > 0) {
                    /* 下限以上の場合 */
                    EDDT[4]--;/* デクリメント */
                    
                } else {
                    /* 下限の場合 */
                    EDDT[4] = 99;/* MAX FIX */
                    
                }
                
                if (EDDT[2] > DAYMAX(EDDT[4], EDDT[3])) {
                    /* 日の上限超えちゃう場合 */
                    EDDT[2] = DAYMAX(EDDT[4], EDDT[3]);/* MAX FIX */
                    
                }
                
            } else if (DSPSSQ == 2) {
                /* 「月」の設定である場合 */
                if (EDDT[3] > 1) {
                    /* 下限以上の場合 */
                    EDDT[3]--;/* デクリメント */
                    
                } else {
                    /* 下限の場合 */
                    EDDT[3] = 12;/* MAX FIX */
                    
                }
                
                if (EDDT[2] > DAYMAX(EDDT[4], EDDT[3])) {
                    /* 日の上限超えちゃう場合 */
                    EDDT[2] = DAYMAX(EDDT[4], EDDT[3]);/* MAX FIX */
                    
                }
                
            } else if (DSPSSQ == 3) {
                /* 「日」の設定である場合 */
                if (EDDT[2] > 1) {
                    /* 下限以上の場合 */
                    EDDT[2]--;/* デクリメント */
                    
                } else {
                    EDDT[2] = DAYMAX(EDDT[4], EDDT[3]);/* MAX FIX */
                    
                }
                
            } else if (DSPSSQ == 4) {
                /* 「時」の設定である場合 */
                if (EDDT[1] > 0) {
                    /* 下限以上の場合 */
                    EDDT[1]--;/* デクリメント */
                    
                } else {
                    /* 下限の場合 */
                    EDDT[1] = 23;/* MAX FIX */
                    
                }
                
            } else if (DSPSSQ == 5) {
                /* 「分」の設定である場合 */
                if (EDDT[0] > 0) {
                    /* 下限以上の場合 */
                    EDDT[0]--;/* デクリメント */
                    
                } else {
                    /* 下限の場合 */
                    EDDT[0] = 59;/* MAX FIX */
                    
