ASAO-KYOICHI/SVC_RCL_PG/tmpm380_OPRCNT.c
                }
                
            }
            
        } else if ((ONTRG & 0x04) > 0) {
            /* →スイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            DSPSSQ++;/* サブシーケンスをインクリメント */
            if (DSPSSQ >= 6) {
                /* 上限以上になった場合 */
                DSPSSQ = 1;/* 下限にする */
                
            }
            
        } else if ((ONTRG & 0x08) > 0) {
            /* 設定スイッチが押された場合 */
            STSFL0 |= 0x40;/* クリック音セット */
            SETST_BUF[1] = EDDT[0];/* 分保存 */
            SETST_BUF[2] = EDDT[1];/* 時保存 */
            SETST_BUF[4] = EDDT[2];/* 日保存 */
            SETST_BUF[5] = EDDT[3];/* 月保存 */
            SETST_BUF[6] = EDDT[4];/* 年保存 */
            SETST_BUF[3] = GETWEEKDAY(EDDT[4], EDDT[3], EDDT[2]);/* 週の値保存 */
            
            WR_RTC |= 0x01;/* 時刻書き込み処理をするフラグを建てる */
            
        }
        
        /* 現在時刻設定である場合ここまで */
        
    } else {
        /* メンテナンスモードである場合 */
        if ((ONTRG & 0x02) > 0) {
            /* DOWNスイッチが押された場合 */
            DABHP = 0;/* 異常履歴の最初をセット */
            STSFL0 |= 0x40;/* クリック音セット */
            
            DSPSSQ++;/* サブシーケンス番号をインクリメント */
            
            if ((SYKND0 & 0x10) > 0) {
                /* 蒸気式である場合 */
                if ((DSPSSQ == 2) || (DSPSSQ == 5)) {
                    /* 予知警報表示か、低温槽温度表示の場合 */
                    DSPSSQ++;/* 画面表示をスキップする */
                    
                }
                
            }
            
            if (DSPSSQ >= 8) {
                /* 画面数以上になった場合 */
                DSPSSQ = 1;/* 戻る */
                
            }
            
        } else if ((ONTRG & 0x01) > 0) {
            /* UPスイッチが押された場合 */
            DABHP = 0;/* 異常履歴の最初をセット */
            STSFL0 |= 0x40;/* クリック音セット */
            
            if (DSPSSQ > 1) {
                /* 下限超であった場合 */
                DSPSSQ--;/* サブシーケンス番号をデクリメント */
                
            } else {
                /* 下限であった場合 */
                DSPSSQ = 7;
                
            }
            
            if ((SYKND0 & 0x10) > 0) {
                /* 蒸気式である場合 */
                if ((DSPSSQ == 2) || (DSPSSQ == 5)) {
                    /* 予知警報表示か、低温槽温度表示の場合 */
                    DSPSSQ--;/* 画面表示をスキップする */
                    
                }
                
            }
            
            if (DSPSSQ == 0) {
                /* 画面数未満になった場合 */
                DSPSSQ = 7;/* 戻る */
                
            }
            
        } else if (DSPSSQ == 1) {
            /* 異常履歴モードである場合 */
            if ((ABNCUT & 0x0F) == 0) {
                /* 異常履歴が0件である場合 */
                DABHP = 0;/* 異常履歴の最初をセットする */
                
            } else if ((ONTRG & 0x04) > 0) {
                /* →スイッチがオンである場合 */
                STSFL0 |= 0x40;/* クリック音セット */
                DABHP++;/* 次の履歴番号をカウントアップする */
                
                if (DABHP > (ABNCUT & 0x0F)) {
                    /* 異常件数を超えた場合 */
                    DABHP = 1;/* 最初の番号にする */
                    
                }
                
            }
            
        } else if (DSPSSQ == 2) {
            /* 予知警報モードである場合 */
            if (((ABNF & 0x20) > 0) && ((ONTRG & 0x04) > 0)) {
                /* 予知警報の登録があり、→スイッチが押されていた場合 */
                STSFL0 |= 0x40;/* クリック音セット */
                YOTINO++;/* インクリメント */
                if (YOTINO >= 2) {
                    /* 予知表示のカウンタがオーバーしている場合 */
                    YOTINO = 0;/* 予知表示のカウンタをクリア */
                    
                }
                
            }
            
        } else {
            /* これら以外の場合 */
            YOTINO = 0;/* クリア */
            
            if (((ONTRG & 0x04) > 0) && ((SYKND0 & 0x10) == 0)) {
                /* →スイッチが押されていて、チラー式である場合 */
                STSFL0 |= 0x40;/* クリック音セット */
                MMODE++;/* マニュアルモードナンバーをインクリメント */
                if (MMODE >= 3) {
                    /* 3以上になる場合 */
                    MMODE = 0;/* 初期モードナンバーをセット */
                    
                }
                
            } else if ((ONTRG & 0x08) > 0) {
                /* 設定スイッチが押された場合 */
                ONTRG &= 0xF7;/* 設定スイッチを強制オフにする */
                
                if ((SYSFLG & 0x40) > 0) {
                    /* 電源オンである場合 */
                    MMODE = 3;/* マニュアルモード操作エラーをセット */
                    MMDTM = 0;/* マニュアルモード用タイマをクリア */
                    
                } else if (MMODE == 0) {
                    /* 全ての槽の排水である場合 */
                    RPAT |= 0xC0;/* 全ての排水弁を開にする */
                    MXOTN0 &= 0x0F;
                    TSB_PG->DATA = MXOTN0;/* データレジスタ更新 */
                    
                    MMODE = 0;/* マニュアルモードナンバーをクリア */
                    STSFL0 |= 0x40;/* クリック音をセット */
                    STSFL0 &= 0x7F;/* 設定モードを抜ける */
                    INDPTM = 0;/* 通常表示復帰タイマをクリア */
                    DSPSEQ = DSPSSQ = 0;/* 画面シーケンスを両方ともクリア */
                    
                } else if (MMODE == 1) {
                    /* 常温水槽の排水である場合 */
                    RPAT |= 0x40;/* 常温槽排水弁を開にする */
                    MXOTN0 &= 0x8F;
                    TSB_PG->DATA = MXOTN0;/* データレジスタ更新 */
                    
                    MMODE = 0;/* マニュアルモードナンバーをクリア */
                    STSFL0 |= 0x40;/* クリック音をセット */
                    STSFL0 &= 0x7F;/* 設定モードを抜ける */
                    INDPTM = 0;/* 通常表示復帰タイマをクリア */
                    DSPSEQ = DSPSSQ = 0;/* 画面シーケンスを両方ともクリア */
                    
                } else if (MMODE == 2) {
                    /* 低温水槽の排水である場合 */
                    RPAT |= 0x80;/* 低温槽排水弁を開にする */
                    MXOTN0 &= 0x4F;
                    TSB_PG->DATA = MXOTN0;/* データレジスタ更新 */
                    
                    MMODE = 0;/* マニュアルモードナンバーをクリア */
                    STSFL0 |= 0x40;/* クリック音をセット */
                    STSFL0 &= 0x7F;/* 設定モードを抜ける */
                    INDPTM = 0;/* 通常表示復帰タイマをクリア */
                    DSPSEQ = DSPSSQ = 0;/* 画面シーケンスを両方ともクリア */
                    
                }
                
            }
            
        }
        
        /* メンテナンスモードである場合ここまで */
        
    }
    
    return;/* 戻る */
    
}

/***
 * 題名：年と月から日数MAX値を返す処理
 * 作成者：浅尾　享一
 * 年・月を基に、日数MAX値を返却するサブルーチン
***/
uint8_t DAYMAX(uint8_t YEAR, uint8_t MONTH)
{
    uint8_t  DAY = 0;
    uint16_t Y_16 = 0;
    
    if (MONTH == 2) {
        /* 2月である場合 */
        Y_16 = (uint16_t)YEAR;/* 年を代入 */
        DAY = (28 + (1 / (Y_16 % 4 + 1)) * (1 - 1 / (Y_16 % 100 + 1)) + (1 / (((Y_16 + 2000) % 400) + 1)));
        
    } else if ((MONTH == 4) || (MONTH == 6) || (MONTH == 9) || (MONTH == 11)) {
        /* 4月、6月、9月、11月である場合 */
        DAY = 30;/* 30をセット */
        
    } else {
        DAY = 31;
        
    }
    
    return DAY;
}